{
  "id": "5b76f523b0a78807b6ffbabd",
  "title": "Frontend developer",
  "teaser": "Build the next-gen health platform",
  "company": "Endicil",
  "created": "2018-02-09T11:10:24",
  "logo": "http://placehold.it/32x32",
  "location": "Unionville",
  "type": "fulltime",
  "salary": 131074,
  "equity": 7,
  "link": "https://apple.com/jobs",
  "email": "robinsonnieves@endicil.com",
  "description": "<div><p>Buying a home is one of life’s biggest financial and emotional decisions. We’re here to make it less stressful, more predictable, and more organized. We’ve built Folio: the first AI powered operating system for real estate transactions. Folio automatically organizes key transaction details and data to take the stress out of the process for both real estate agents and their clients.</p><p>The magic happens right in an agent’s email, putting all the key details about a transaction right at their fingertips -- while organizing each transaction into Smart Folders and a timeline that clients use to stay on track.</p><p>We are a team of passionate product people and engineers that gets excited about solving complex processes and creating value for our users with AI and machine learning. We’re currently looking for full-stack engineers, data scientists and machine learning experts to add to our remote team.</p><p>We are a strong agile shop - we practice solo and pair programming, TDD, daily standups, weekly IPMs and weekly retros. Our product development process is driven by user research in which all members of the team are involved. </p><p>As a full-stack engineer at Amitree, you’ll have the opportunity to work on all aspects of the product, from our machine-learning algorithms that analyze millions of emails each day all the way through our front-end interfaces. You'll work to write well tested code and ship it to production in a matter of hours. The company places a high value on the health of the codebase, and allots time every week to the engineering team to do maintenance tasks that help keep our system up-to-date and healthy. Technical qualifications are listed below.</p><p><strong>Requirements</strong>:</p><ul><li>Extensive senior-level software development experience, managing and scaling complex web applications, algorithm design, handling and mitigating production incidents, and software architecture and design</li><li>Significant experience with a Javascript front-end framework</li><li>Experience with automated testing</li></ul><p><strong>Nice-to-haves</strong>:</p><ul><li>BA degree, preferably in computer science</li><li>Experience with Ruby on Rails</li><li>Experience with test-driven development</li><li>Experience with pair programming</li><li>Experience with continuous deployment, continuous integration, and testing frameworks</li></ul><p><strong>Perks</strong>:</p><ul><li>Autonomy and responsibility, control and ownership over what you produce</li><li>Health, dental, and vision insurance with fully paid premium for you and your dependents</li><li>Reimbursement for the cost of a gym &amp; One Medical membership</li><li>Flexible paid time off / vacation - we encourage everyone to take at least three weeks off each year</li><li>401(k) plan administered by Vanguard's website</p></li></ul></div>"
}
